# 作業 : (Kaggle)鐵達尼生存預測

# [作業目標]
- 試著完成三種不同特徵類型的三種資料操作, 觀察結果
- 思考一下, 這三種特徵類型, 哪一種應該最複雜/最難處理

# [作業重點]
- 完成剩餘的八種 類型 x 操作組合 (In[6]~In[13], Out[6]~Out[13])
- 思考何種特徵類型, 應該最複雜

In [1]:
# 載入基本套件
import pandas as pd
import numpy as np

# 讀取訓練與測試資料
data_path = '/Users/syuan/Downloads/特徵類型_HW/'
df_train = pd.read_csv(data_path + 'titanic_train.csv')
df_test = pd.read_csv(data_path + 'titanic_test.csv')
df_train.shape

(891, 12)

In [2]:
ids=df_test['PassengerId']
y_train=df_train['Survived']
df_train=df_train.drop(columns=['PassengerId','Survived'])
df_test=df_test.drop(columns=['PassengerId'])
df=pd.concat([df_train,df_test],axis=0).reset_index(drop=True)
df

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
1304,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1305,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1306,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1307,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1308,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [3]:
df_type=df.dtypes.reset_index()
df_type.columns=['count','dtype']
df_type=df_type.groupby('dtype').agg('count').reset_index()
df_type

     dtype  count
0    int64      3
1  float64      2
2   object      5

In [4]:
int_feature=[]
float_feature=[]
object_feature=[]

for col in df:
    if df[col].dtype=='int64':
        int_feature.append(col)
    elif df[col].dtype=='float64':
        float_feature.append(col)
    else:
        object_feature.append(col)
print('int_feature:',int_feature)
print('float_feature:',float_feature)
print('object_feature:',object_feature)

int_feature: ['Pclass', 'SibSp', 'Parch']
float_feature: ['Age', 'Fare']
object_feature: ['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [5]:
# 秀出資料欄位的類型與數量
dtype_df = df.dtypes.reset_index()
dtype_df.columns = ["Count", "Column Type"]
dtype_df = dtype_df.groupby("Column Type").aggregate('count').reset_index()
dtype_df

  Column Type  Count
0       int64      3
1     float64      2
2      object      5

In [6]:
#確定只有 int64, float64, object 三種類型後, 分別將欄位名稱存於三個 list 中
int_features = []
float_features = []
object_features = []
for dtype, feature in zip(df.dtypes, df.columns):
    if dtype == 'float64':
        float_features.append(feature)
    elif dtype == 'int64':
        int_features.append(feature)
    else:
        object_features.append(feature)
print(f'{len(int_features)} Integer Features : {int_features}\n')
print(f'{len(float_features)} Float Features : {float_features}\n')
print(f'{len(object_features)} Object Features : {object_features}')

3 Integer Features : ['Pclass', 'SibSp', 'Parch']

2 Float Features : ['Age', 'Fare']

5 Object Features : ['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

# 作業1 
* 試著執行作業程式，觀察三種類型 (int / float / object) 的欄位分別進行( 平均 mean / 最大值 Max / 相異值 nunique )  
中的九次操作會有那些問題? 並試著解釋那些發生Error的程式區塊的原因?  

# 作業2
* 思考一下，試著舉出今天五種類型以外的一種或多種資料類型，你舉出的新類型是否可以歸在三大類中的某些大類?  
所以三大類特徵中，哪一大類處理起來應該最複雜?

In [19]:
# 例 : 整數 (int) 特徵取平均 (mean)
print(df[int_features].mean())
print(df[int_features].max())
print(df[object_features].nunique())
print("============")
print(df[float_features].mean())
print(df[float_features].max())
print(df[float_features].nunique())
print("============")
print(df[object_features].mean())
print(df[object_features].max())
print(df[object_features].nunique())

Pclass    2.294882
SibSp     0.498854
Parch     0.385027
dtype: float64
Pclass    3
SibSp     8
Parch     9
dtype: int64
Name        1307
Sex            2
Ticket       929
Cabin        186
Embarked       3
dtype: int64
============
Age     29.881138
Fare    33.295479
dtype: float64
Age      80.0000
Fare    512.3292
dtype: float64
Age      98
Fare    281
dtype: int64
============
Series([], dtype: float64)
Series([], dtype: float64)
Name        1307
Sex            2
Ticket       929
Cabin        186
Embarked       3
dtype: int64

In [20]:
# 請依序列出 三種特徵類型 (int / float / object) x 三種方法 (平均 mean / 最大值 Max / 相異值 nunique) 的其餘操作
"""
1.類別資料無法做平均與最大值，只能找有幾個相異值
2.時間序列資料若要補空值可能要從前後一個值補，且須視情況刪除季節性。
"""

'\n類別資料無法做平均與最大值，只能找有幾個相異值\n'